import random

# 47都道府県***************:
dict = { 
    "ジャガイモ":"北海道",
    "りんご":"青森",
    "わんこそば":"岩手",
    "こけし":"宮城",
    "きりたんぽ鍋":"秋田",
    "さくらんぼ":"山形",
    "喜多方ラーメン":"福島",
    "納豆":"茨城",
    "かんぴょう":"栃木",
    "こんにゃく":"群馬",
    "ひな人形":"埼玉",
    "しょうゆ":"千葉",
    "書籍":"東京",
    "かまぼこ":"神奈川",
    "小千谷ちぢみ":"新潟",
    "チューリップ":"富山",
    "輪島ぬり":"石川",
    "越前かに":"福井",
    "ぶどう":"山梨",
    "信州みそ":"長野",
    "和紙":"岐阜",
    "お茶":"静岡",
    "瀬戸焼":"愛知",
    "松坂牛":"三重",
    "信楽焼":"滋賀",
    "西陣織":"京都",
    "たこやき":"大阪",
    "そろばん":"兵庫",
    "筆":"奈良",
    "うめ":"和歌山",
    "二十世紀なし":"鳥取",
    "しじみ":"島根",
    "備前焼":"岡山",
    "かき":"広島",
    "ふぐ":"山口",
    "すだち":"徳島",
    "さぬきうどん":"香川",
    "いよかん":"愛媛",
    "かつおぶし":"高知",
    "博多人形":"福岡",
    "伊万里焼":"佐賀",
    "カステラ":"長崎",
    "トマト":"熊本",
    "竹細工":"大分",
    "ピーマン":"宮崎",
    "さつまあげ":"鹿児島",
    "パイナップル":"沖縄",
}
正解 = 0
総問題 = 0
正解率 = 0
n = []
print("!!全国特産物都道府県当てクイズ!!" \
"(参考元URL[https://www.zenkyozu.co.jp/wp-content/uploads/2011/06/45a75d571dc57e97f31e356d5fec9590.pdf])")
input("ゲーム説明:辞書からランダムで１問選択されて[〇〇はどこの都道府県の特産物でしょう]と表示されるので答えてください(※漢字で入力)。"
       \
    "EnterでOK")
while True:
    総問題 += 1
    if 正解 == 47:
        print("全問回答済")
        break
    random_q = random.choice(list(dict.items()))
    問題,答え = random_q
    回答 = input(f"{問題}はどこの都道府県の特産物でしょう")
    
    if 回答 == "exit":
        if 総問題 > 1:
            総問題 -= 1
        elif 総問題 == 0:
            pass
        break
    elif 回答 == 答え:
        print("正解")
        del dict[問題]
        正解 += 1
    else:
        print("不正解")
        n.append(f"{問題} → {答え}")
        print(f"正解は{答え}でした")
正解率 = int(正解) / int(総問題) * 100
print(f"正解率:{int(float(正解率))}%")
for i in range(len(n)):
    print(n[i])
    # print("終了")